#  Pivoting on one variable

##  Assignment 

Pivot tables are the standard way of aggregating data in spreadsheets. 

In pandas, pivot tables are essentially another way of performing grouped calculations. That is, the `.pivot_table()` method is an alternative to `.groupby()`. 

In this exercise, you'll perform calculations using `.pivot_table()` to replicate the calculations you performed in the last lesson using `.groupby()`.

In [1]:
import pandas as pd

In [2]:
sales = pd.read_csv("sales.csv")

In [4]:
sales.head()

,Unnamed: 0,store,type,department,date,weekly_sales,is_holiday,temperature_c,fuel_price_usd_per_l,unemployment
0,0,1,A,1,2010-02-05,24924.50,False,5.727778,0.679451,8.106
1,1,1,A,1,2010-03-05,21827.90,False,8.055556,0.693452,8.106
2,2,1,A,1,2010-04-02,57258.43,False,16.816667,0.718284,7.808
3,3,1,A,1,2010-05-07,17413.94,False,22.527778,0.748928,7.808
4,4,1,A,1,2010-06-04,17558.09,False,27.050000,0.714586,7.808

##  Instructions 

- Get the mean `weekly_sales` by `type` using `.pivot_table()` and store as `mean_sales_by_type`.



```
# Pivot for mean weekly_sales for each store type
mean_sales_by_type = sales.____

# Print mean_sales_by_type
print(mean_sales_by_type)
```

In [6]:
mean_sales_by_type = sales.pivot_table(values="weekly_sales", index="type")

In [7]:
mean_sales_by_type

      weekly_sales
type
A     23674.667242
B     25696.678370

- Get the mean and median (using NumPy functions) of `weekly_sales` by `type` using `.pivot_table()` and store as `mean_med_sales_by_type`.

In [8]:
import numpy as np

In [9]:
mean_med_sales_by_type = sales.pivot_table(values="weekly_sales", index="type", aggfunc=['mean', 'median'])

In [10]:
mean_med_sales_by_type

              mean       median
      weekly_sales weekly_sales
type
A     23674.667242     11943.92
B     25696.678370     13336.08

- Get the mean of `weekly_sales` by `type` and `is_holiday` using `.pivot_table()` and store as `mean_sales_by_type_holiday`.

In [11]:
mean_sales_by_type_holiday = sales.pivot_table(values="weekly_sales", index=["type", "is_holiday"])

In [12]:
mean_sales_by_type_holiday

                 weekly_sales
type is_holiday
A    False       23768.583523
     True          590.045250
B    False       25751.980533
     True          810.705000